open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_turn_audio.c
/****************************************************************************
 * tests/host/bk7258/test_bk7258_voice_turn_audio.c
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

#include <assert.h>
#include <errno.h>
#include <media_player.h>
#include <media_policy.h>
#include <media_recorder.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "bk7258_voice_turn.h"
#include "bk7258_voice_turn_audio.h"

#ifdef CONFIG_BK7258_PREFERENCES
#include "bk7258_preferences.h"
#endif

#define TEST_FRAME_BYTES 640u
#define TEST_TRACE_MAX   64u

enum test_call_e
{
  TEST_REC_OPEN = 1,
  TEST_REC_PREPARE,
  TEST_REC_START,
  TEST_REC_READ,
  TEST_REC_STOP,
  TEST_REC_CLOSE,
  TEST_PLAYER_OPEN,
  TEST_PLAYER_PREPARE,
  TEST_PLAYER_START,
  TEST_PLAYER_WRITE,
  TEST_PLAYER_EOF,
  TEST_PLAYER_CLOSE,
#ifdef CONFIG_BK7258_PREFERENCES
  TEST_PREFS_READ,
#endif
  TEST_VOLUME_RANGE,
  TEST_VOLUME_SET,
  TEST_VOLUME_GET,
#ifdef CONFIG_BK7258_VOICE_VOLUME_PERSISTENCE
  TEST_VOLUME_STORE_GET,
  TEST_VOLUME_STORE_SET,
#endif
};

struct test_media_s
{
  enum test_call_e trace[TEST_TRACE_MAX];
  size_t trace_count;
  enum test_call_e fail_call;
  unsigned int fail_count;
  bool recorder_open;
  bool recorder_prepared;
  bool recorder_started;
  bool player_open;
  bool player_prepared;
  bool player_started;
  bool defer_completion;
  bool overlap;
};

static struct test_media_s g_media;
static int g_recorder_handle;
static int g_player_handle;
static media_event_callback g_player_callback;
static void *g_player_cookie;

int media_player_set_event_callback(void *handle, void *cookie,
                                    media_event_callback callback)
{
  assert(handle == &g_player_handle);
  g_player_callback = callback;
  g_player_cookie = cookie;
  return 0;
}

static int test_call(enum test_call_e call)
{
  assert(g_media.trace_count < TEST_TRACE_MAX);
  g_media.trace[g_media.trace_count++] = call;
  if (g_media.fail_call == call && g_media.fail_count > 0)
    {
      g_media.fail_count--;
      return -EIO;
    }

  return 0;
}

static int g_volume_index;
static int g_range_max = 15;
static bool g_volume_mismatch;

#ifdef CONFIG_BK7258_PREFERENCES
static unsigned int g_percent = 50;

int bk7258_preferences_playback_volume(unsigned int *volume_percent)
{
  *volume_percent = g_percent;
  return test_call(TEST_PREFS_READ);
}
#endif

#ifdef CONFIG_BK7258_VOICE_VOLUME_PERSISTENCE
static unsigned int g_store_percent;
static int g_store_get_result;
static int g_store_set_result;
static unsigned int g_store_set_calls;

int bkvoice_volume_store_get(unsigned int *volume_percent)
{
  int ret = test_call(TEST_VOLUME_STORE_GET);

  if (ret < 0)
    {
      return ret;
    }

  if (g_store_get_result < 0)
    {
      return g_store_get_result;
    }

  *volume_percent = g_store_percent;
  return 0;
}

int bkvoice_volume_store_set(unsigned int volume_percent)
{
  int ret = test_call(TEST_VOLUME_STORE_SET);

  g_store_set_calls++;
  if (ret < 0)
    {
      return ret;
    }

  if (g_store_set_result < 0)
    {
      return g_store_set_result;
    }

  g_store_percent = volume_percent;
  g_store_get_result = 0;
  return 0;
}

static void reset_volume_store(void)
{
  g_store_percent = 0;
  g_store_get_result = -ENOENT;
  g_store_set_result = 0;
  g_store_set_calls = 0;
}
#endif

int media_policy_get_range(const char *name, int *minimum, int *maximum)
{
  assert(strcmp(name, MEDIA_STREAM_MUSIC MEDIA_POLICY_VOLUME) == 0);
  *minimum = 0;
  *maximum = g_range_max;
  return test_call(TEST_VOLUME_RANGE);
}

int media_policy_set_stream_volume(const char *stream, int index)
{
  assert(strcmp(stream, MEDIA_STREAM_MUSIC) == 0);
  g_volume_index = index;
  return test_call(TEST_VOLUME_SET);
}

int media_policy_get_stream_volume(const char *stream, int *index)
{
  assert(strcmp(stream, MEDIA_STREAM_MUSIC) == 0);
  *index = g_volume_index + (g_volume_mismatch ? 1 : 0);
  return test_call(TEST_VOLUME_GET);
}

void *media_recorder_open(const char *params)
{
  int ret = test_call(TEST_REC_OPEN);

  assert(params != NULL && strcmp(params, MEDIA_SOURCE_MIC) == 0);
  if (g_media.player_open)
    {
      g_media.overlap = true;
    }

  if (ret < 0)
    {
      errno = EIO;
      return NULL;
    }

  assert(!g_media.recorder_open);
  g_media.recorder_open = true;
  return &g_recorder_handle;
}

int media_recorder_prepare(void *handle, const char *url,
                           const char *options)
{
  int ret = test_call(TEST_REC_PREPARE);

  assert(handle == &g_recorder_handle && url == NULL);
  assert(options != NULL &&
         strcmp(options,
                "format=s16le:sample_rate=16000:ch_layout=mono") == 0);
  if (ret >= 0)
    {
      g_media.recorder_prepared = true;
    }

  return ret;
}

int media_recorder_start(void *handle)
{
  int ret = test_call(TEST_REC_START);

  assert(handle == &g_recorder_handle && g_media.recorder_prepared);
  if (ret >= 0)
    {
      g_media.recorder_started = true;
    }

  return ret;
}

ssize_t media_recorder_read_data(void *handle, void *data, size_t len)
{
  int ret = test_call(TEST_REC_READ);

  assert(handle == &g_recorder_handle && data != NULL && len > 0);
  assert(g_media.recorder_started);
  if (ret < 0)
    {
      return ret;
    }

  memset(data, 0x5a, len);
  return (ssize_t)len;
}

int media_recorder_stop(void *handle)
{
  int ret = test_call(TEST_REC_STOP);

  assert(handle == &g_recorder_handle && g_media.recorder_open);
  if (ret >= 0)
    {
      g_media.recorder_started = false;
    }

  return ret;
}

int media_recorder_close(void *handle)
{
  int ret = test_call(TEST_REC_CLOSE);

  assert(handle == &g_recorder_handle && g_media.recorder_open);
  if (ret >= 0)
    {
      g_media.recorder_open = false;
      g_media.recorder_prepared = false;
      g_media.recorder_started = false;
    }

  return ret;
}

void *media_player_open(const char *stream)
{
  int ret = test_call(TEST_PLAYER_OPEN);

  assert(stream != NULL && strcmp(stream, MEDIA_STREAM_MUSIC) == 0);
  if (g_media.recorder_open)
    {
      g_media.overlap = true;
    }

