open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_turn_audio.c
  if (ret < 0)
    {
      errno = EIO;
      return NULL;
    }

  assert(!g_media.player_open);
  g_media.player_open = true;
  return &g_player_handle;
}

int media_player_prepare(void *handle, const char *url,
                         const char *options)
{
  int ret = test_call(TEST_PLAYER_PREPARE);

  assert(handle == &g_player_handle && url == NULL);
  assert(options != NULL &&
         strcmp(options,
                "format=s16le:sample_rate=16000:ch_layout=mono") == 0);
  if (ret >= 0)
    {
      g_media.player_prepared = true;
    }

  return ret;
}

int media_player_start(void *handle)
{
  int ret = test_call(TEST_PLAYER_START);

  assert(handle == &g_player_handle && g_media.player_prepared);
  if (ret >= 0)
    {
      g_media.player_started = true;
    }

  return ret;
}

ssize_t media_player_write_data(void *handle, const void *data, size_t len)
{
  int ret = test_call(TEST_PLAYER_WRITE);

  assert(handle == &g_player_handle && data != NULL && len > 0);
  assert(g_media.player_started);
  return ret < 0 ? ret : (ssize_t)len;
}

void media_player_close_socket(void *handle)
{
  int ret = test_call(TEST_PLAYER_EOF);

  assert(handle == &g_player_handle && g_media.player_open);
  if (ret >= 0)
    {
      g_media.player_prepared = false;
      g_media.player_started = false;
    }

  if (!g_media.defer_completion)
    {
      g_player_callback(g_player_cookie, MEDIA_EVENT_COMPLETED, ret, NULL);
    }
}

int media_player_close(void *handle, int pending_stop)
{
  int ret = test_call(TEST_PLAYER_CLOSE);

  assert(handle == &g_player_handle && pending_stop == 0);
  assert(g_media.player_open);
  if (ret >= 0)
    {
      if (g_media.defer_completion)
        {
          g_player_callback(g_player_cookie, MEDIA_EVENT_COMPLETED, 0, NULL);
          g_media.defer_completion = false;
        }
      g_media.player_open = false;
      g_media.player_prepared = false;
      g_media.player_started = false;
    }

  return ret;
}

static const struct bkvoice_turn_limits_s g_limits =
{
  .capture_timeout_ms = 1000,
  .waiting_tts_timeout_ms = 2000,
  .playback_timeout_ms = 3000,
  .audio_frame_bytes = TEST_FRAME_BYTES,
};

static struct bkvoice_turn_token_s test_event(
  const struct bkvoice_turn_token_s *token, uint32_t sequence)
{
  struct bkvoice_turn_token_s event = *token;

  event.sequence = sequence;
  return event;
}

static void test_initialize(struct bkvoice_turn_s *turn,
                            struct bkvoice_turn_audio_s *audio)
{
  memset(&g_media, 0, sizeof(g_media));
#ifdef CONFIG_BK7258_VOICE_VOLUME_PERSISTENCE
  reset_volume_store();
#endif
  assert(bkvoice_turn_audio_initialize(audio) == 0);
  assert(bkvoice_turn_audio_released(audio));
  assert(bkvoice_turn_initialize(turn, bkvoice_turn_audio_ops(), audio,
                                 &g_limits, 11) == 0);
  assert(bkvoice_turn_session_open(turn, 3) == 0);
}

static void test_normal_turn(void)
{
  static const enum test_call_e expected[] =
  {
    TEST_REC_OPEN, TEST_REC_PREPARE, TEST_REC_START, TEST_REC_READ,
    TEST_REC_STOP, TEST_REC_CLOSE,
    TEST_PLAYER_OPEN, TEST_PLAYER_PREPARE,
#ifdef CONFIG_BK7258_PREFERENCES
    TEST_PREFS_READ, TEST_VOLUME_RANGE, TEST_VOLUME_SET, TEST_VOLUME_GET,
#elif defined(CONFIG_BK7258_VOICE_VOLUME_PERSISTENCE)
    TEST_VOLUME_STORE_GET,
#endif
    TEST_PLAYER_START,
    TEST_PLAYER_WRITE, TEST_PLAYER_EOF, TEST_PLAYER_CLOSE,
  };
  struct bkvoice_turn_audio_s audio;
  struct bkvoice_turn_token_s token;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_s turn;
  uint8_t pcm[TEST_FRAME_BYTES];

  test_initialize(&turn, &audio);
  assert(bkvoice_turn_ptt_down(&turn, 3, 1, 100, &token) == 0);
  assert(bkvoice_turn_audio_reader_attach(&audio) == 0);
  assert(bkvoice_turn_audio_reader_attach(&audio) == -EALREADY);
  assert(bkvoice_turn_audio_read(&audio, pcm, sizeof(pcm)) ==
         (ssize_t)sizeof(pcm));
  assert(pcm[0] == 0x5a && pcm[sizeof(pcm) - 1] == 0x5a);
  assert(bkvoice_turn_audio_reader_detach(&audio) == 0);

  event = test_event(&token, 2);
  assert(bkvoice_turn_ptt_up(&turn, &event, 200) == 0);
  event = test_event(&token, 1);
  assert(bkvoice_turn_tts_start(&turn, &event, 300) == 0);
  event.sequence = 2;
  assert(bkvoice_turn_tts_audio(&turn, &event, pcm, sizeof(pcm),
                                400) == 0);
  event.sequence = 3;
  assert(bkvoice_turn_tts_end(&turn, &event) == 0);
  assert(turn.state == BKVOICE_TURN_DRAINING);
  assert(bkvoice_turn_poll(&turn) == 0);
  assert(bkvoice_turn_audio_released(&audio));
  assert(!g_media.recorder_open && !g_media.player_open &&
         !g_media.overlap);
  assert(g_media.trace_count == sizeof(expected) / sizeof(expected[0]));
  assert(memcmp(g_media.trace, expected, sizeof(expected)) == 0);
}

#ifdef CONFIG_BK7258_VOICE_VOLUME_PERSISTENCE
static void test_persistent_volume_policy(void)
{
  const struct bkvoice_turn_audio_ops_s *ops = bkvoice_turn_audio_ops();
  struct bkvoice_turn_audio_s audio;
  struct bkvoice_turn_s turn;
  unsigned int observed = UINT32_MAX;
  size_t before;

  /* The first query after boot restores the durable value and reports the
   * media-policy quantized result without writing flash again.
   */

  test_initialize(&turn, &audio);
  g_store_get_result = 0;
  g_store_percent = 73;
  g_volume_index = 8;
  g_range_max = 15;
  assert(ops->volume(&audio, false, 0, &observed) == 0);
  assert(observed == 73 && g_volume_index == 11);
  assert(audio.volume_override && audio.volume_percent == 73);
  assert(g_store_set_calls == 0);
  g_store_percent = 24; /* Later settings change uses the same store. */
  assert(ops->dac_acquire(&audio) == 0);
  assert(ops->dac_prepare(&audio) == 0);
  assert(g_volume_index == 4);
  assert(ops->dac_release(&audio) == 0);

  /* A failed durable publication leaves the current media policy untouched
   * and cannot produce a successful VOLUME_REPORT.
   */

  test_initialize(&turn, &audio);
  g_volume_index = 8;
  g_store_set_result = -ENOSPC;
  before = g_media.trace_count;
  assert(ops->volume(&audio, true, 65, &observed) == -ENOSPC);
  assert(g_volume_index == 8 && !audio.volume_override);
  assert(g_media.trace_count == before + 1);
  assert(g_media.trace[before] == TEST_VOLUME_STORE_SET);

