open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_turn_audio.c
  /* If media application fails after publication, the next query reconciles
   * the saved value instead of claiming that the failed call applied it.
   */

  test_initialize(&turn, &audio);
  g_volume_index = 8;
  g_media.fail_call = TEST_VOLUME_SET;
  g_media.fail_count = 1;
  assert(ops->volume(&audio, true, 65, &observed) == -EIO);
  assert(g_store_percent == 65 && g_store_get_result == 0);
  assert(!audio.volume_override);
  assert(ops->volume(&audio, false, 0, &observed) == 0);
  assert(observed == 67 && audio.volume_override);

  /* Corrupt/unavailable preference data never takes voice playback offline. */

  test_initialize(&turn, &audio);
  g_store_get_result = -EBADMSG;
  assert(ops->dac_acquire(&audio) == 0);
  assert(ops->dac_prepare(&audio) == 0);
  assert(ops->dac_release(&audio) == 0);
  assert(bkvoice_turn_audio_released(&audio));
}
#endif

static void test_recorder_close_recovery(void)
{
  struct bkvoice_turn_audio_s audio;
  struct bkvoice_turn_token_s token;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_s turn;

  test_initialize(&turn, &audio);
  assert(bkvoice_turn_ptt_down(&turn, 3, 1, 0, &token) == 0);
  g_media.fail_call = TEST_REC_CLOSE;
  g_media.fail_count = 1;
  event = test_event(&token, 2);
  assert(bkvoice_turn_ptt_up(&turn, &event, 1) == -EIO);
  assert(turn.state == BKVOICE_TURN_FAULTED);
  assert(audio.mic_handle != NULL && g_media.recorder_open);
  assert(bkvoice_turn_recover(&turn) == 0);
  assert(turn.state == BKVOICE_TURN_IDLE);
  assert(bkvoice_turn_audio_released(&audio));
}

static void test_player_stop_retry(void)
{
  struct bkvoice_turn_audio_s audio;
  struct bkvoice_turn_token_s token;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_s turn;
  uint8_t pcm[TEST_FRAME_BYTES] = {0};
  size_t before;

  test_initialize(&turn, &audio);
  assert(bkvoice_turn_ptt_down(&turn, 3, 1, 0, &token) == 0);
  event = test_event(&token, 2);
  assert(bkvoice_turn_ptt_up(&turn, &event, 1) == 0);
  event = test_event(&token, 1);
  assert(bkvoice_turn_tts_start(&turn, &event, 2) == 0);
  event.sequence = 2;
  assert(bkvoice_turn_tts_audio(&turn, &event, pcm, sizeof(pcm), 3) == 0);

  g_media.fail_call = TEST_PLAYER_EOF;
  g_media.fail_count = 1;
  before = g_media.trace_count;
  event.sequence = 3;
  assert(bkvoice_turn_tts_end(&turn, &event) == 0);
  assert(bkvoice_turn_poll(&turn) == -EIO);
  assert(g_media.trace_count == before + 2);
  assert(g_media.trace[before] == TEST_PLAYER_EOF);
  assert(g_media.trace[before + 1] == TEST_PLAYER_CLOSE);
  assert(turn.state == BKVOICE_TURN_IDLE);
  assert(bkvoice_turn_audio_released(&audio));
}

static void test_cancel_does_not_drain_and_can_retry_close(void)
{
  struct bkvoice_turn_audio_s audio;
  struct bkvoice_turn_token_s token;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_s turn;
  uint8_t pcm[TEST_FRAME_BYTES] = {0};
  size_t before;

  test_initialize(&turn, &audio);
  assert(bkvoice_turn_ptt_down(&turn, 3, 1, 0, &token) == 0);
  event = test_event(&token, 2);
  assert(bkvoice_turn_ptt_up(&turn, &event, 1) == 0);
  event = test_event(&token, 1);
  assert(bkvoice_turn_tts_start(&turn, &event, 2) == 0);
  event.sequence = 2;
  assert(bkvoice_turn_tts_audio(&turn, &event, pcm, sizeof(pcm), 3) == 0);
  g_media.defer_completion = true;
  event.sequence = 3;
  assert(bkvoice_turn_tts_end(&turn, &event) == 0);
  assert(turn.state == BKVOICE_TURN_DRAINING);
  assert(bkvoice_turn_poll(&turn) == 0);
  assert(turn.state == BKVOICE_TURN_DRAINING);
  before = g_media.trace_count;
  g_media.fail_call = TEST_PLAYER_CLOSE;
  g_media.fail_count = 2;
  event = test_event(&token, 3);
  assert(bkvoice_turn_cancel(&turn, &event, -ECANCELED) == -EIO);
  assert(turn.state == BKVOICE_TURN_FAULTED);
  assert(audio.dac_handle != NULL && g_media.player_open);
  assert(g_media.trace_count == before + 2);
  assert(g_media.trace[before] == TEST_PLAYER_CLOSE);
  assert(g_media.trace[before + 1] == TEST_PLAYER_CLOSE);
  assert(bkvoice_turn_recover(&turn) == 0);
  assert(g_media.trace_count == before + 3);
  assert(g_media.trace[before + 2] == TEST_PLAYER_CLOSE);
  assert(bkvoice_turn_audio_released(&audio));
  assert(bkvoice_turn_poll(&turn) == 0);
  assert(turn.state == BKVOICE_TURN_IDLE);

  /* The callback racing with the previous close must not finish a new turn. */

  assert(bkvoice_turn_ptt_down(&turn, 3, 4, 10, &token) == 0);
  event = test_event(&token, 5);
  assert(bkvoice_turn_ptt_up(&turn, &event, 11) == 0);
  event = test_event(&token, turn.last_downlink_sequence + 1);
  assert(bkvoice_turn_tts_start(&turn, &event, 12) == 0);
  g_media.defer_completion = true;
  event.sequence++;
  assert(bkvoice_turn_tts_end(&turn, &event) == 0);
  assert(bkvoice_turn_poll(&turn) == 0);
  assert(turn.state == BKVOICE_TURN_DRAINING);
  g_media.defer_completion = false;
  g_player_callback(g_player_cookie, MEDIA_EVENT_COMPLETED, 0, NULL);
  assert(bkvoice_turn_poll(&turn) == 0);
  assert(turn.state == BKVOICE_TURN_IDLE);
}

static void test_player_close_recovery(void)
{
  struct bkvoice_turn_audio_s audio;
  struct bkvoice_turn_token_s token;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_s turn;

  test_initialize(&turn, &audio);
  assert(bkvoice_turn_ptt_down(&turn, 3, 1, 0, &token) == 0);
  event = test_event(&token, 2);
  assert(bkvoice_turn_ptt_up(&turn, &event, 1) == 0);
  event = test_event(&token, 1);
  assert(bkvoice_turn_tts_start(&turn, &event, 2) == 0);

  g_media.fail_call = TEST_PLAYER_CLOSE;
  g_media.fail_count = 2;
  event.sequence = 2;
  assert(bkvoice_turn_tts_end(&turn, &event) == 0);
  assert(bkvoice_turn_poll(&turn) == -EIO);
  assert(turn.state == BKVOICE_TURN_FAULTED);
  assert(audio.dac_handle != NULL && g_media.player_open);
  assert(bkvoice_turn_recover(&turn) == 0);
  assert(turn.state == BKVOICE_TURN_IDLE);
  assert(bkvoice_turn_audio_released(&audio));
}

static void test_guards_and_open_failure(void)
{
  struct bkvoice_turn_audio_s audio;
  struct bkvoice_turn_token_s token;
  struct bkvoice_turn_s turn;
  uint8_t pcm[TEST_FRAME_BYTES];

  assert(bkvoice_turn_audio_initialize(NULL) == -EINVAL);
  assert(bkvoice_turn_audio_reader_attach(NULL) == -EINVAL);
  assert(bkvoice_turn_audio_reader_stop(NULL) == -EINVAL);
  assert(!bkvoice_turn_audio_released(NULL));
  assert(bkvoice_turn_audio_initialize(&audio) == 0);
  assert(bkvoice_turn_audio_reader_attach(&audio) == -EPERM);
  assert(bkvoice_turn_audio_reader_stop(&audio) == -EPERM);
  assert(bkvoice_turn_audio_reader_detach(&audio) == -EALREADY);
  assert(bkvoice_turn_audio_read(&audio, pcm, sizeof(pcm)) == -EPERM);

  test_initialize(&turn, &audio);
  g_media.fail_call = TEST_REC_OPEN;
  g_media.fail_count = 1;
  assert(bkvoice_turn_ptt_down(&turn, 3, 1, 0, &token) == -EIO);
  assert(turn.state == BKVOICE_TURN_IDLE);
  assert(bkvoice_turn_audio_released(&audio));
}

static void test_reader_stop_join_sequence(void)
{
  static const enum test_call_e expected[] =
  {
    TEST_REC_OPEN, TEST_REC_PREPARE, TEST_REC_START,
    TEST_REC_STOP, TEST_REC_CLOSE,
  };
  const struct bkvoice_capture_source_ops_s *source_ops;
  struct bkvoice_turn_audio_s audio;
  struct bkvoice_turn_token_s token;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_s turn;

  test_initialize(&turn, &audio);
  source_ops = bkvoice_turn_audio_capture_source_ops();
  assert(source_ops != NULL);
  assert(bkvoice_turn_ptt_down(&turn, 3, 1, 0, &token) == 0);
  assert(source_ops->attach(&audio) == 0);

  /* PTT owner interrupts the recorder, joins this reader task, then the
   * worker detaches.  Only after that may the arbiter release the MIC.
   */

