open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_turn_audio.c
  assert(source_ops->interrupt(&audio) == 0);
  assert(!audio.mic_started && audio.mic_reader_active);
  assert(source_ops->detach(&audio) == 0);
  event = test_event(&token, 2);
  assert(bkvoice_turn_ptt_up(&turn, &event, 1) == 0);
  assert(turn.state == BKVOICE_TURN_WAITING_TTS);
  assert(bkvoice_turn_audio_released(&audio));
  assert(g_media.trace_count == sizeof(expected) / sizeof(expected[0]));
  assert(memcmp(g_media.trace, expected, sizeof(expected)) == 0);
}

static void test_reader_pins_recorder(void)
{
  struct bkvoice_turn_audio_s audio;
  struct bkvoice_turn_token_s token;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_s turn;

  test_initialize(&turn, &audio);
  assert(bkvoice_turn_ptt_down(&turn, 3, 1, 0, &token) == 0);
  assert(bkvoice_turn_audio_reader_attach(&audio) == 0);
  event = test_event(&token, 2);
  assert(bkvoice_turn_ptt_up(&turn, &event, 1) == -EBUSY);
  assert(turn.state == BKVOICE_TURN_FAULTED);
  assert(audio.mic_handle != NULL && g_media.recorder_open);
  assert(bkvoice_turn_recover(&turn) == -EBUSY);
  assert(audio.mic_handle != NULL && g_media.recorder_open);
  assert(bkvoice_turn_audio_reader_detach(&audio) == 0);
  assert(bkvoice_turn_recover(&turn) == 0);
  assert(turn.state == BKVOICE_TURN_IDLE);
  assert(bkvoice_turn_audio_released(&audio));
}

static void test_runtime_volume_policy(void)
{
  const struct bkvoice_turn_audio_ops_s *ops = bkvoice_turn_audio_ops();
  struct bkvoice_turn_audio_s audio;
  struct bkvoice_turn_s turn;
  unsigned int observed = UINT32_MAX;

  test_initialize(&turn, &audio);
  g_volume_index = 8;
  g_range_max = 15;
  g_volume_mismatch = false;
  assert(ops->volume != NULL);
  assert(ops->volume(&audio, false, 0, &observed) == 0 && observed == 53);
  assert(ops->volume(&audio, true, 65, &observed) == 0);
  assert(observed == 67 && audio.volume_override);
  assert(audio.volume_percent == 65);
  assert(ops->volume(&audio, true, 101, &observed) == -EINVAL);
  g_volume_mismatch = true;
  assert(ops->volume(&audio, true, 40, &observed) == -EIO);
  assert(audio.volume_percent == 65);
  g_volume_mismatch = false;

  assert(ops->dac_acquire(&audio) == 0);
  assert(ops->dac_prepare(&audio) == 0);
#ifdef CONFIG_BK7258_VOICE_VOLUME_PERSISTENCE
  /* 40 was committed even though immediate policy application failed. */
  assert(g_volume_index == 6);
#else
  assert(g_volume_index == 10); /* RAM-only override survives next turn. */
#endif
  assert(ops->dac_release(&audio) == 0);
  assert(bkvoice_turn_audio_released(&audio));
}

#ifdef CONFIG_BK7258_PREFERENCES
static void test_stored_volume_policy(void)
{
  struct bkvoice_turn_audio_s audio;
  struct bkvoice_turn_token_s token;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_s turn;

  for (unsigned int i = 0; i < 8; i++)
    {
      test_initialize(&turn, &audio);
      assert(bkvoice_turn_ptt_down(&turn, 3, 1, 0, &token) == 0);
      event = test_event(&token, 2);
      assert(bkvoice_turn_ptt_up(&turn, &event, 1) == 0);
      event = test_event(&token, 1);
      g_percent = i == 6 ? 101 : 73;
      g_range_max = i == 5 ? 0 : 15;
      g_volume_mismatch = i == 4;
      if (i < 4)
        {
          g_media.fail_call = TEST_PREFS_READ + i;
          g_media.fail_count = 1;
        }
      int ret = bkvoice_turn_tts_start(&turn, &event, 2);
      if (i < 7)
        {
          assert(ret == (i == 5 || i == 6 ? -ERANGE : -EIO));
          assert(!g_media.player_started);
          assert(bkvoice_turn_audio_released(&audio));
        }
      else
        {
          assert(ret == 0 && g_volume_index == 11);
          event.sequence = 2;
          assert(bkvoice_turn_tts_end(&turn, &event) == 0);
          assert(turn.state == BKVOICE_TURN_DRAINING);
          assert(bkvoice_turn_poll(&turn) == 0);
          assert(bkvoice_turn_audio_released(&audio));
        }
    }
  static const unsigned int percentages[] = {0, 1, 50, 99, 100, 50};
  static const int maxima[] = {15, 15, 15, 15, 15, 31};
  static const int expected[] = {0, 0, 8, 15, 15, 16};
  g_volume_mismatch = false;
  for (unsigned int i = 0; i < sizeof(percentages) / sizeof(percentages[0]); i++)
    {
      const struct bkvoice_turn_audio_ops_s *ops = bkvoice_turn_audio_ops();
      test_initialize(&turn, &audio);
      g_percent = percentages[i];
      g_range_max = maxima[i];
      assert(ops->dac_acquire(&audio) == 0);
      assert(ops->dac_prepare(&audio) == 0);
      assert(g_volume_index == expected[i]);
      assert(ops->dac_release(&audio) == 0);
      assert(bkvoice_turn_audio_released(&audio));
    }
  g_percent = 50;
  g_range_max = 15;
}
#endif

int main(void)
{
  test_normal_turn();
  test_recorder_close_recovery();
  test_player_stop_retry();
  test_player_close_recovery();
  test_cancel_does_not_drain_and_can_retry_close();
  test_guards_and_open_failure();
  test_reader_stop_join_sequence();
  test_reader_pins_recorder();
  test_runtime_volume_policy();
  puts("BKVOICE_TURN_VOLUME_HOST_PASS");
#ifdef CONFIG_BK7258_PREFERENCES
  test_stored_volume_policy();
#endif
#ifdef CONFIG_BK7258_VOICE_VOLUME_PERSISTENCE
  test_persistent_volume_policy();
#endif
  puts("BKVOICE_TURN_AUDIO_HOST_PASS");
  return 0;
}
